//
//  DZ 25 Skut NSBut_Calcul.h
//  DZ 25 Skut_NSBut_Calcul
//
//  Created by mac on 09.12.17.
//  Copyright © 2017 Dima Zgera. All rights reserved.
//

#ifndef DZ_25_Skut_NSBut_Calcul_h
#define DZ_25_Skut_NSBut_Calcul_h

#include <stdio.h>

#endif /* DZ_25_Skut_NSBut_Calcul_h */



//------------DZ 25 - NSButton Calculator  -- Никита Тепляков
Вот друзья, обстановка становится все веселее, раньше мы с вами только в консоль смотрели, а теперь уже потихоньку приложения собираем :) Задание будет тоже, что я говорил в уроке, а именно - сделать калькулятор :)

Ученик.

1. Создайте и разместите кнопки цифр и операторов, создайте нужные акшины
2. Добавьте лейбл и создайте соответствующий проперти
3. По нажатию на кнопку на индикатор должна выводиться либо цифра, либо оператор (никаких вычислений - выводим просто значения кнопок)

Студент.

4. Наведите более / менее красоту, можете насоздавать линий (вьюхи с малой шириной)б ставить бэкграундыб используйте картинки если надо и тд. - проявите творчество :)
5. Сделайте так, чтобы когда нажимаешь на цифровую кнопку, то число росло
6. Сделайте кнопку сброса

Мастер.

7. Сохраняйте вводимое число
8. Первую операцию тоже надо сохранить, пока не ввели второе число (используйте енумы!)
9. Когда нажимаешь равно то первое число выболняет операцию над вторым и выводится результат
10. После того, как результат вывелся на экран, он автоматом становиться первым числом и к нему уже можно прибавлять, вычитать и т.д. - как в калькулятор

Супермен

11. Добавьте точку, теперь можно вводить и дробное число, точка должна работать также, как и точка на обычном калькуляторе (имею в виду, что двух точек в числе быть не может в случае повторного нажатия)
12. С дробным вводом будет посложнее - задание для настоящих суперменов :)

Жду результатов!
